[Timeout] BlockStatement
routes/cart.js:6:45
 const router = express.Router();
 
 // Create a new cart for a user
-router.post('/:userId', async (req, res) => {
-  try {
-    const userId = req.params.userId;
-    if (userId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún usuario" }) }
-    const cart = await CartService.createCart(userId);
-    return res.status(201).json(cart);
-  } catch (error) {
-    return res.status(400).json({ error: error.message });
-  }
-});
+router.post('/:userId', async (req, res) => {});
 
 // Add an item to the cart

[Timeout] BlockStatement
routes/cart.js:7:7
 
 // Create a new cart for a user
 router.post('/:userId', async (req, res) => {
-  try {
-    const userId = req.params.userId;
-    if (userId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún usuario" }) }
-    const cart = await CartService.createCart(userId);
-    return res.status(201).json(cart);
-  } catch (error) {
+  try {} catch (error) {
     return res.status(400).json({ error: error.message });
   }

[Killed] ConditionalExpression
routes/cart.js:9:9
 router.post('/:userId', async (req, res) => {
   try {
     const userId = req.params.userId;
-    if (userId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún usuario" }) }
+    if (false) { return res.status(400).json({ error: "No se ha seleccionado algún usuario" }) }
     const cart = await CartService.createCart(userId);
     return res.status(201).json(cart);
killedBy: Cart Routes POST /api/carts/:userId should return error message
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] EqualityOperator
routes/cart.js:9:9
 router.post('/:userId', async (req, res) => {
   try {
     const userId = req.params.userId;
-    if (userId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún usuario" }) }
+    if (userId > 0) { return res.status(400).json({ error: "No se ha seleccionado algún usuario" }) }
     const cart = await CartService.createCart(userId);
     return res.status(201).json(cart);
killedBy: Cart Routes POST /api/carts/:userId should create a new cart
statusReason: Error: expected 201 "Created", got 400 "Bad Request"

[NoCoverage] BlockStatement
routes/cart.js:12:19
     if (userId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún usuario" }) }
     const cart = await CartService.createCart(userId);
     return res.status(201).json(cart);
-  } catch (error) {
-    return res.status(400).json({ error: error.message });
-  }
+  } catch (error) {}
 });
 

[NoCoverage] ObjectLiteral
routes/cart.js:13:33
     const cart = await CartService.createCart(userId);
     return res.status(201).json(cart);
   } catch (error) {
-    return res.status(400).json({ error: error.message });
+    return res.status(400).json({});
   }
 });

[Timeout] BlockStatement
routes/cart.js:29:50
 });
 
 // Get all items in a cart
-router.get('/:cartId/items', async (req, res) => {
-  try {
-    const cartId = req.params.cartId;
-    if (cartId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún carrito" }) }
-    const items = await CartService.getCartItems(req.params.cartId);
-    return res.json(items);
-  } catch (errors) {
-    return res.status(400).json({ error: errors.message });
-  }
-});
+router.get('/:cartId/items', async (req, res) => {});
 
 // Update quantity of a cart item

[Timeout] BlockStatement
routes/cart.js:30:7
 
 // Get all items in a cart
 router.get('/:cartId/items', async (req, res) => {
-  try {
-    const cartId = req.params.cartId;
-    if (cartId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún carrito" }) }
-    const items = await CartService.getCartItems(req.params.cartId);
-    return res.json(items);
-  } catch (errors) {
+  try {} catch (errors) {
     return res.status(400).json({ error: errors.message });
   }

[Killed] BlockStatement
routes/cart.js:32:22
 router.get('/:cartId/items', async (req, res) => {
   try {
     const cartId = req.params.cartId;
-    if (cartId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún carrito" }) }
+    if (cartId <= 0) {}
     const items = await CartService.getCartItems(req.params.cartId);
     return res.json(items);
killedBy: Cart Routes GET /api/carts/:cartId/items should return error message
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
routes/cart.js:32:9
 router.get('/:cartId/items', async (req, res) => {
   try {
     const cartId = req.params.cartId;
-    if (cartId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún carrito" }) }
+    if (false) { return res.status(400).json({ error: "No se ha seleccionado algún carrito" }) }
     const items = await CartService.getCartItems(req.params.cartId);
     return res.json(items);
killedBy: Cart Routes GET /api/carts/:cartId/items should return error message
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[NoCoverage] BlockStatement
routes/cart.js:35:20
     if (cartId <= 0) { return res.status(400).json({ error: "No se ha seleccionado algún carrito" }) }
     const items = await CartService.getCartItems(req.params.cartId);
     return res.json(items);
-  } catch (errors) {
-    return res.status(400).json({ error: errors.message });
-  }
+  } catch (errors) {}
 });
 
