[Killed] BlockStatement
services/productService.js:70:34
         ? categoryIdsStr.split(',').map(id => parseInt(id))
         : [];
 
-        if (!categoryIds.length) {
-            throw new Error('Categories parameter is required');
-        }
+        if (!categoryIds.length) {}
 
         const { sort, limit, offset } = options;
killedBy: Product Routes GET /api/products/categories should return error if categories query is missing
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] StringLiteral
services/productService.js:71:29
         : [];
 
         if (!categoryIds.length) {
-            throw new Error('Categories parameter is required');
+            throw new Error("");
         }
 
killedBy: Product Routes GET /api/products/categories should return error if categories query is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Categories parameter is required"
Received: ""
