[Killed] ConditionalExpression
services/cartService.js:16:9
       throw new Error('Product not found');
     }
 
-    if (product.inventory < quantity) {
+    if (true) {
       throw new Error('Not enough inventory available');
     }
killedBy: CartService addItemToCart should create a new item in the cart if it does not already exist
statusReason: Error: Not enough inventory available

[Killed] BlockStatement
services/cartService.js:27:44
 
     if (existingItem) {
       const newQuantity = existingItem.quantity + quantity;
-      if (product.inventory < newQuantity) {
-        throw new Error('Not enough inventory available');
-      }
+      if (product.inventory < newQuantity) {}
       existingItem.quantity = newQuantity;
       await existingItem.save();
killedBy: CartService addItemToCart should handle case when updating item quantity results in insufficient inventory
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Not enough inventory available"
Received message:   "existingItem.save is not a function"

      105 |           }
      106 |           existingItem.quantity = newQuantity;
    > 107 |           await existingItem.save();

[Killed] EqualityOperator
services/cartService.js:80:9
       throw new Error('Item not found');
     }
 
-    if (cartItem.Product.inventory < quantity) {
+    if (cartItem.Product.inventory >= quantity) {
       throw new Error('Not enough inventory available');
     }
killedBy: CartService updateCartItem should update the cart item quantity correctly
statusReason: Error: Not enough inventory available
