[NoCoverage] StringLiteral
app.js:13:9
 
 app.use(bodyParser.json());
 app.use('/cart', cartRouter);
-app.use('/categories', categoriesRouter);
+app.use("", categoriesRouter);
 app.use('/products', productsRouter);
 

[NoCoverage] ObjectLiteral
app.js:17:18
 app.use('/products', productsRouter);
 
 // Remove the immediate invocation and export both app and sequelize
-module.exports = { app, sequelize };
+module.exports = {};
