[Killed] EqualityOperator
models/index.js:3:4
 const { Sequelize } = require('sequelize');
 
-if(process.env.NODE_ENV === 'test') {
+if(process.env.NODE_ENV !== 'test') {
   const sequelize = new Sequelize({
     dialect: 'sqlite',
killedBy: Product Routes POST /api/products should create a new product
statusReason: Error:

[Survived] ConditionalExpression
models/index.js:3:4
 const { Sequelize } = require('sequelize');
 
-if(process.env.NODE_ENV === 'test') {
+if(false) {
   const sequelize = new Sequelize({
     dialect: 'sqlite',

[Survived] BooleanLiteral
models/index.js:7:14
   const sequelize = new Sequelize({
     dialect: 'sqlite',
     storage: ':memory:',
-    logging: false
+    logging: true
   });
 

[NoCoverage] BlockStatement
models/index.js:11:8
   });
 
   module.exports = { sequelize };
-} else {
-  const sequelize = new Sequelize({
-    dialect: 'sqlite',
-    storage: './db.sqlite',
-  });
-
-  module.exports = { sequelize };
-}
+} else {}
 

[NoCoverage] ObjectLiteral
models/index.js:12:35
 
   module.exports = { sequelize };
 } else {
-  const sequelize = new Sequelize({
-    dialect: 'sqlite',
-    storage: './db.sqlite',
-  });
+  const sequelize = new Sequelize({});
 
   module.exports = { sequelize };
