[Timeout] BlockStatement
routes/categories.js:6:38
 const router = express.Router();
 
 // Create a category
-router.post('/', async (req, res) => {
-  try {
-    const category = await Category.create(req.body);
-    res.status(201).json(category);
-  } catch (error) {
-    res.status(400).json({ error: error.message });
-  }
-});
+router.post('/', async (req, res) => {});
 
 // Get all categories

[Survived] StringLiteral
routes/categories.js:6:13
 const router = express.Router();
 
 // Create a category
-router.post('/', async (req, res) => {
+router.post("", async (req, res) => {
   try {
     const category = await Category.create(req.body);

[Timeout] BlockStatement
routes/categories.js:7:7
 
 // Create a category
 router.post('/', async (req, res) => {
-  try {
-    const category = await Category.create(req.body);
-    res.status(201).json(category);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ error: error.message });
   }

[NoCoverage] BlockStatement
routes/categories.js:10:19
   try {
     const category = await Category.create(req.body);
     res.status(201).json(category);
-  } catch (error) {
-    res.status(400).json({ error: error.message });
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
routes/categories.js:16:37
 });
 
 // Get all categories
-router.get('/', async (req, res) => {
-  const categories = await Category.findAll();
-  res.json(categories);
-});
+router.get('/', async (req, res) => {});
 
 module.exports = router;
