[NoCoverage] BlockStatement
routes/products.js:8:38
 const ProductService = require('../services/productService');
 
 // Create a product
-router.post('/', async (req, res) => {
-  try {
-    const product = await ProductService.createProduct(req.body);
-    res.status(201).json(product);
-  } catch (error) {
-    res.status(400).json({ error: error.message });
-  }
-});
+router.post('/', async (req, res) => {});
 
 // Get all products

[NoCoverage] BlockStatement
routes/products.js:9:7
 
 // Create a product
 router.post('/', async (req, res) => {
-  try {
-    const product = await ProductService.createProduct(req.body);
-    res.status(201).json(product);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ error: error.message });
   }

[NoCoverage] BlockStatement
routes/products.js:12:19
   try {
     const product = await ProductService.createProduct(req.body);
     res.status(201).json(product);
-  } catch (error) {
-    res.status(400).json({ error: error.message });
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
routes/products.js:18:37
 });
 
 // Get all products
-router.get('/', async (req, res) => {
-  try {
-    const products = await ProductService.getAllProducts();
-    res.json(products);
-  } catch (error) {
-    res.status(500).json({ error: error.message });
-  }
-});
+router.get('/', async (req, res) => {});
 
 // Get products by category

[NoCoverage] BlockStatement
routes/products.js:19:7
 
 // Get all products
 router.get('/', async (req, res) => {
-  try {
-    const products = await ProductService.getAllProducts();
-    res.json(products);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ error: error.message });
   }

[NoCoverage] BlockStatement
routes/products.js:22:19
   try {
     const products = await ProductService.getAllProducts();
     res.json(products);
-  } catch (error) {
-    res.status(500).json({ error: error.message });
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
routes/products.js:28:57
 });
 
 // Get products by category
-router.get('/category/:categoryId', async (req, res) => {
-  try {
-    const options = {
-      sort: req.query.sort,
-      limit: req.query.limit,
-      offset: req.query.offset
-    };
-    
-    const products = await ProductService.getProductsByCategory(
-      req.params.categoryId, 
-      options
-    );
-    
-    res.json(products);
-  } catch (error) {
-    res.status(400).json({ error: error.message });
-  }
-});
+router.get('/category/:categoryId', async (req, res) => {});
 
 // Get products by multiple categories

[Survived] StringLiteral
routes/products.js:28:12
 });
 
 // Get products by category
-router.get('/category/:categoryId', async (req, res) => {
+router.get("", async (req, res) => {
   try {
     const options = {

[NoCoverage] BlockStatement
routes/products.js:29:7
 
 // Get products by category
 router.get('/category/:categoryId', async (req, res) => {
-  try {
-    const options = {
-      sort: req.query.sort,
-      limit: req.query.limit,
-      offset: req.query.offset
-    };
-    
-    const products = await ProductService.getProductsByCategory(
-      req.params.categoryId, 
-      options
-    );
-    
-    res.json(products);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ error: error.message });
   }

[NoCoverage] ObjectLiteral
routes/products.js:30:21
 // Get products by category
 router.get('/category/:categoryId', async (req, res) => {
   try {
-    const options = {
-      sort: req.query.sort,
-      limit: req.query.limit,
-      offset: req.query.offset
-    };
+    const options = {};
     
     const products = await ProductService.getProductsByCategory(

[NoCoverage] BlockStatement
routes/products.js:42:19
     );
     
     res.json(products);
-  } catch (error) {
-    res.status(400).json({ error: error.message });
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
routes/products.js:48:47
 });
 
 // Get products by multiple categories
-router.get('/categories', async (req, res) => {
-  try {
-    const options = {
-      sort: req.query.sort,
-      limit: req.query.limit,
-      offset: req.query.offset
-    };
-    
-    const products = await ProductService.getProductsByCategories(
-      req.query.categories,
-      options
-    );
-    
-    res.json(products);
-  } catch (error) {
-    res.status(400).json({ error: error.message });
-  }
-});
+router.get('/categories', async (req, res) => {});
 
 module.exports = router;

[Survived] StringLiteral
routes/products.js:48:12
 });
 
 // Get products by multiple categories
-router.get('/categories', async (req, res) => {
+router.get("", async (req, res) => {
   try {
     const options = {

[NoCoverage] BlockStatement
routes/products.js:49:7
 
 // Get products by multiple categories
 router.get('/categories', async (req, res) => {
-  try {
-    const options = {
-      sort: req.query.sort,
-      limit: req.query.limit,
-      offset: req.query.offset
-    };
-    
-    const products = await ProductService.getProductsByCategories(
-      req.query.categories,
-      options
-    );
-    
-    res.json(products);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ error: error.message });
   }
