[NoCoverage] LogicalOperator
server.js:2:14
 const { app, sequelize } = require('./app');
-const PORT = process.env.PORT || 3000;
+const PORT = process.env.PORT && 3000;
 
 sequelize.sync({ alter: true }) // or use { alter: true } for less destructive changes

[NoCoverage] ConditionalExpression
server.js:2:14
 const { app, sequelize } = require('./app');
-const PORT = process.env.PORT || 3000;
+const PORT = true;
 
 sequelize.sync({ alter: true }) // or use { alter: true } for less destructive changes

[NoCoverage] BooleanLiteral
server.js:4:25
 const { app, sequelize } = require('./app');
 const PORT = process.env.PORT || 3000;
 
-sequelize.sync({ alter: true }) // or use { alter: true } for less destructive changes
+sequelize.sync({ alter: false }) // or use { alter: true } for less destructive changes
   .then(() => {
     app.listen(PORT, () => {

[NoCoverage] BlockStatement
server.js:5:15
 const PORT = process.env.PORT || 3000;
 
 sequelize.sync({ alter: true }) // or use { alter: true } for less destructive changes
-  .then(() => {
-    app.listen(PORT, () => {
-        console.log(`Server is running on http://localhost:${PORT}`);
-      console.log('Database synced successfully');
-    });
-  })
+  .then(() => {})
   .catch(error => {
     console.error('Unable to sync database:', error);

[NoCoverage] BlockStatement
server.js:6:28
 
 sequelize.sync({ alter: true }) // or use { alter: true } for less destructive changes
   .then(() => {
-    app.listen(PORT, () => {
-        console.log(`Server is running on http://localhost:${PORT}`);
-      console.log('Database synced successfully');
-    });
+    app.listen(PORT, () => {});
   })
   .catch(error => {

[NoCoverage] BlockStatement
server.js:11:19
       console.log('Database synced successfully');
     });
   })
-  .catch(error => {
-    console.error('Unable to sync database:', error);
-  });
+  .catch(error => {});

[NoCoverage] StringLiteral
server.js:12:19
     });
   })
   .catch(error => {
-    console.error('Unable to sync database:', error);
+    console.error("", error);
   });
