[NoCoverage] BlockStatement
services/cartService.js:6:35
 const Product = require('../models/product');
 
 class CartService {
-  static async createCart(userId) {
-    return await Cart.create({ userId });
-  }
+  static async createCart(userId) {}
 
   static async addItemToCart(cartId, productId, quantity) {

[NoCoverage] ConditionalExpression
services/cartService.js:12:9
 
   static async addItemToCart(cartId, productId, quantity) {
     const product = await Product.findByPk(productId);
-    if (!product) {
+    if (true) {
       throw new Error('Product not found');
     }

[NoCoverage] ConditionalExpression
services/cartService.js:12:9
 
   static async addItemToCart(cartId, productId, quantity) {
     const product = await Product.findByPk(productId);
-    if (!product) {
+    if (false) {
       throw new Error('Product not found');
     }

[NoCoverage] StringLiteral
services/cartService.js:13:23
   static async addItemToCart(cartId, productId, quantity) {
     const product = await Product.findByPk(productId);
     if (!product) {
-      throw new Error('Product not found');
+      throw new Error("");
     }
     

[NoCoverage] EqualityOperator
services/cartService.js:16:9
       throw new Error('Product not found');
     }
     
-    if (product.inventory < quantity) {
+    if (product.inventory >= quantity) {
       throw new Error('Not enough inventory available');
     }

[NoCoverage] EqualityOperator
services/cartService.js:16:9
       throw new Error('Product not found');
     }
     
-    if (product.inventory < quantity) {
+    if (product.inventory <= quantity) {
       throw new Error('Not enough inventory available');
     }

[NoCoverage] BlockStatement
services/cartService.js:25:23
       where: { cartId, productId }
     });
 
-    if (existingItem) {
-      const newQuantity = existingItem.quantity + quantity;
-      if (product.inventory < newQuantity) {
-        throw new Error('Not enough inventory available');
-      }
-      existingItem.quantity = newQuantity;
-      await existingItem.save();
-      return existingItem;
-    }
+    if (existingItem) {}
 
     return await CartItem.create({ cartId, productId, quantity });

[NoCoverage] ArithmeticOperator
services/cartService.js:26:27
     });
 
     if (existingItem) {
-      const newQuantity = existingItem.quantity + quantity;
+      const newQuantity = existingItem.quantity - quantity;
       if (product.inventory < newQuantity) {
         throw new Error('Not enough inventory available');

[NoCoverage] ConditionalExpression
services/cartService.js:27:11
 
     if (existingItem) {
       const newQuantity = existingItem.quantity + quantity;
-      if (product.inventory < newQuantity) {
+      if (false) {
         throw new Error('Not enough inventory available');
       }

[NoCoverage] EqualityOperator
services/cartService.js:27:11
 
     if (existingItem) {
       const newQuantity = existingItem.quantity + quantity;
-      if (product.inventory < newQuantity) {
+      if (product.inventory <= newQuantity) {
         throw new Error('Not enough inventory available');
       }

[NoCoverage] StringLiteral
services/cartService.js:28:25
     if (existingItem) {
       const newQuantity = existingItem.quantity + quantity;
       if (product.inventory < newQuantity) {
-        throw new Error('Not enough inventory available');
+        throw new Error("");
       }
       existingItem.quantity = newQuantity;

[NoCoverage] ObjectLiteral
services/cartService.js:40:14
 
   static async getCartItems(cartId) {
     const items = await CartItem.findAll({
-      where: { cartId },
+      where: {},
       include: Product,
     });

[NoCoverage] BlockStatement
services/cartService.js:47:47
     let subtotal = 0;
     let totalTax = 0;
 
-    const itemsWithTotals = items.map(item => {
-      const itemSubtotal = item.quantity * item.Product.price;
-      const itemTax = itemSubtotal * item.Product.taxRate;
-      
-      subtotal += itemSubtotal;
-      totalTax += itemTax;
-
-      return {
-        ...item.toJSON(),
-        itemSubtotal,
-        itemTax
-      };
-    });
+    const itemsWithTotals = items.map(item => {});
 
     return {

[NoCoverage] ArithmeticOperator
services/cartService.js:48:28
     let totalTax = 0;
 
     const itemsWithTotals = items.map(item => {
-      const itemSubtotal = item.quantity * item.Product.price;
+      const itemSubtotal = item.quantity / item.Product.price;
       const itemTax = itemSubtotal * item.Product.taxRate;
       

[NoCoverage] ArithmeticOperator
services/cartService.js:49:23
 
     const itemsWithTotals = items.map(item => {
       const itemSubtotal = item.quantity * item.Product.price;
-      const itemTax = itemSubtotal * item.Product.taxRate;
+      const itemTax = itemSubtotal / item.Product.taxRate;
       
       subtotal += itemSubtotal;

[NoCoverage] AssignmentOperator
services/cartService.js:51:7
       const itemSubtotal = item.quantity * item.Product.price;
       const itemTax = itemSubtotal * item.Product.taxRate;
       
-      subtotal += itemSubtotal;
+      subtotal -= itemSubtotal;
       totalTax += itemTax;
 

[NoCoverage] AssignmentOperator
services/cartService.js:52:7
       const itemTax = itemSubtotal * item.Product.taxRate;
       
       subtotal += itemSubtotal;
-      totalTax += itemTax;
+      totalTax -= itemTax;
 
       return {

[NoCoverage] ObjectLiteral
services/cartService.js:61:12
       };
     });
 
-    return {
-      items: itemsWithTotals,
-      summary: {
-        subtotal,
-        totalTax,
-        total: subtotal + totalTax
-      }
-    };
+    return {};
   }
 

[NoCoverage] ArithmeticOperator
services/cartService.js:66:16
       summary: {
         subtotal,
         totalTax,
-        total: subtotal + totalTax
+        total: subtotal - totalTax
       }
     };

[NoCoverage] BlockStatement
services/cartService.js:71:49
     };
   }
 
-  static async updateCartItem(itemId, quantity) {
-    const cartItem = await CartItem.findByPk(itemId, {
-      include: Product
-    });
-    
-    if (!cartItem) {
-      throw new Error('Item not found');
-    }
-
-    if (cartItem.Product.inventory < quantity) {
-      throw new Error('Not enough inventory available');
-    }
-
-    cartItem.quantity = quantity;
-    await cartItem.save();
-    return cartItem;
-  }
+  static async updateCartItem(itemId, quantity) {}
 
   static async removeCartItem(itemId) {

[NoCoverage] ConditionalExpression
services/cartService.js:76:9
       include: Product
     });
     
-    if (!cartItem) {
+    if (true) {
       throw new Error('Item not found');
     }

[NoCoverage] BooleanLiteral
services/cartService.js:76:9
       include: Product
     });
     
-    if (!cartItem) {
+    if (cartItem) {
       throw new Error('Item not found');
     }

[NoCoverage] StringLiteral
services/cartService.js:77:23
     });
     
     if (!cartItem) {
-      throw new Error('Item not found');
+      throw new Error("");
     }
 

[NoCoverage] EqualityOperator
services/cartService.js:80:9
       throw new Error('Item not found');
     }
 
-    if (cartItem.Product.inventory < quantity) {
+    if (cartItem.Product.inventory <= quantity) {
       throw new Error('Not enough inventory available');
     }

[NoCoverage] BlockStatement
services/cartService.js:80:48
       throw new Error('Item not found');
     }
 
-    if (cartItem.Product.inventory < quantity) {
-      throw new Error('Not enough inventory available');
-    }
+    if (cartItem.Product.inventory < quantity) {}
 
     cartItem.quantity = quantity;

[NoCoverage] BlockStatement
services/cartService.js:89:39
     return cartItem;
   }
 
-  static async removeCartItem(itemId) {
-    const cartItem = await CartItem.findByPk(itemId);
-    if (!cartItem) {
-      throw new Error('Item not found');
-    }
-    await cartItem.destroy();
-  }
+  static async removeCartItem(itemId) {}
 }
 

[NoCoverage] ConditionalExpression
services/cartService.js:91:9
 
   static async removeCartItem(itemId) {
     const cartItem = await CartItem.findByPk(itemId);
-    if (!cartItem) {
+    if (false) {
       throw new Error('Item not found');
     }

[NoCoverage] ConditionalExpression
services/cartService.js:91:9
 
   static async removeCartItem(itemId) {
     const cartItem = await CartItem.findByPk(itemId);
-    if (!cartItem) {
+    if (true) {
       throw new Error('Item not found');
     }
