[NoCoverage] BlockStatement
services/productService.js:6:35
 const { Op } = require('sequelize');
 
 class ProductService {
-    static async getAllProducts() {
-        return await Product.findAll();
-    }
+    static async getAllProducts() {}
 
     static async getProductById(id) {

[NoCoverage] BlockStatement
services/productService.js:10:37
         return await Product.findAll();
     }
 
-    static async getProductById(id) {
-        return await Product.findByPk(id);
-    }
+    static async getProductById(id) {}
 
     static async createProduct(product) {

[NoCoverage] BlockStatement
services/productService.js:14:41
         return await Product.findByPk(id);
     }
 
-    static async createProduct(product) {
-        // Check if category exists
-        const category = await Category.findByPk(product.categoryId);
-        if (!category) {
-            throw new Error(`Category with id ${product.categoryId} does not exist`);
-        }
-        
-        return await Product.create(product);
-    }
+    static async createProduct(product) {}
 
     static async updateProduct(id, product) {

[NoCoverage] ConditionalExpression
services/productService.js:17:13
     static async createProduct(product) {
         // Check if category exists
         const category = await Category.findByPk(product.categoryId);
-        if (!category) {
+        if (true) {
             throw new Error(`Category with id ${product.categoryId} does not exist`);
         }

[NoCoverage] BooleanLiteral
services/productService.js:17:13
     static async createProduct(product) {
         // Check if category exists
         const category = await Category.findByPk(product.categoryId);
-        if (!category) {
+        if (category) {
             throw new Error(`Category with id ${product.categoryId} does not exist`);
         }

[NoCoverage] StringLiteral
services/productService.js:18:29
         // Check if category exists
         const category = await Category.findByPk(product.categoryId);
         if (!category) {
-            throw new Error(`Category with id ${product.categoryId} does not exist`);
+            throw new Error(``);
         }
         

[NoCoverage] BlockStatement
services/productService.js:24:45
         return await Product.create(product);
     }
 
-    static async updateProduct(id, product) {
-        // If categoryId is being updated, check if new category exists
-        if (product.categoryId) {
-            const category = await Category.findByPk(product.categoryId);
-            if (!category) {
-                throw new Error(`Category with id ${product.categoryId} does not exist`);
-            }
-        }
-
-        return await Product.update(product, { where: { id } });
-    }
+    static async updateProduct(id, product) {}
 
     static async deleteProduct(id) {

[NoCoverage] BlockStatement
services/productService.js:26:33
 
     static async updateProduct(id, product) {
         // If categoryId is being updated, check if new category exists
-        if (product.categoryId) {
-            const category = await Category.findByPk(product.categoryId);
-            if (!category) {
-                throw new Error(`Category with id ${product.categoryId} does not exist`);
-            }
-        }
+        if (product.categoryId) {}
 
         return await Product.update(product, { where: { id } });

[NoCoverage] ConditionalExpression
services/productService.js:26:13
 
     static async updateProduct(id, product) {
         // If categoryId is being updated, check if new category exists
-        if (product.categoryId) {
+        if (false) {
             const category = await Category.findByPk(product.categoryId);
             if (!category) {

[NoCoverage] BlockStatement
services/productService.js:28:28
         // If categoryId is being updated, check if new category exists
         if (product.categoryId) {
             const category = await Category.findByPk(product.categoryId);
-            if (!category) {
-                throw new Error(`Category with id ${product.categoryId} does not exist`);
-            }
+            if (!category) {}
         }
 

[NoCoverage] BlockStatement
services/productService.js:36:36
         return await Product.update(product, { where: { id } });
     }
 
-    static async deleteProduct(id) {
-        return await Product.destroy({ where: { id } });
-    }
+    static async deleteProduct(id) {}
 
     static async getProductsByCategory(categoryId, options = {}) {

[NoCoverage] BlockStatement
services/productService.js:40:66
         return await Product.destroy({ where: { id } });
     }
 
-    static async getProductsByCategory(categoryId, options = {}) {
-        const { sort, limit, offset } = options;
-        
-        const queryOptions = {
-            where: { categoryId },
-            include: Category,
-        };
-
-        // Add sorting if specified
-        if (sort) {
-            queryOptions.order = [sort.split(',')];  // e.g. "price,DESC"
-        }
-
-        // Add pagination if specified
-        if (limit) {
-            queryOptions.limit = parseInt(limit);
-        }
-        if (offset) {
-            queryOptions.offset = parseInt(offset);
-        }
-
-        return await Product.findAll(queryOptions);
-    }
+    static async getProductsByCategory(categoryId, options = {}) {}
 
     static async getProductsByCategories(categoryIdsStr, options = {}) {

[NoCoverage] ObjectLiteral
services/productService.js:44:20
         const { sort, limit, offset } = options;
         
         const queryOptions = {
-            where: { categoryId },
+            where: {},
             include: Category,
         };

[NoCoverage] ConditionalExpression
services/productService.js:49:13
         };
 
         // Add sorting if specified
-        if (sort) {
+        if (true) {
             queryOptions.order = [sort.split(',')];  // e.g. "price,DESC"
         }

[NoCoverage] BlockStatement
services/productService.js:49:19
         };
 
         // Add sorting if specified
-        if (sort) {
-            queryOptions.order = [sort.split(',')];  // e.g. "price,DESC"
-        }
+        if (sort) {}
 
         // Add pagination if specified

[NoCoverage] ConditionalExpression
services/productService.js:54:13
         }
 
         // Add pagination if specified
-        if (limit) {
+        if (true) {
             queryOptions.limit = parseInt(limit);
         }

[NoCoverage] BlockStatement
services/productService.js:54:20
         }
 
         // Add pagination if specified
-        if (limit) {
-            queryOptions.limit = parseInt(limit);
-        }
+        if (limit) {}
         if (offset) {
             queryOptions.offset = parseInt(offset);

[NoCoverage] BlockStatement
services/productService.js:57:21
         if (limit) {
             queryOptions.limit = parseInt(limit);
         }
-        if (offset) {
-            queryOptions.offset = parseInt(offset);
-        }
+        if (offset) {}
 
         return await Product.findAll(queryOptions);

[NoCoverage] ConditionalExpression
services/productService.js:57:13
         if (limit) {
             queryOptions.limit = parseInt(limit);
         }
-        if (offset) {
+        if (false) {
             queryOptions.offset = parseInt(offset);
         }

[NoCoverage] ArrowFunction
services/productService.js:67:41
     static async getProductsByCategories(categoryIdsStr, options = {}) {
         // Get categories from query parameter: ?categories=1,2,3
         const categoryIds = categoryIdsStr
-        ? categoryIdsStr.split(',').map(id => parseInt(id))
+        ? categoryIdsStr.split(',').map(() => undefined)
         : [];
 

[NoCoverage] ArrayDeclaration
services/productService.js:68:11
         // Get categories from query parameter: ?categories=1,2,3
         const categoryIds = categoryIdsStr
         ? categoryIdsStr.split(',').map(id => parseInt(id))
-        : [];
+        : ["Stryker was here"];
 
         if (!categoryIds.length) {

[NoCoverage] ConditionalExpression
services/productService.js:70:13
         ? categoryIdsStr.split(',').map(id => parseInt(id))
         : [];
 
-        if (!categoryIds.length) {
+        if (true) {
         return res.status(400).json({ error: 'Categories parameter is required' });
         }

[NoCoverage] BlockStatement
services/productService.js:70:34
         ? categoryIdsStr.split(',').map(id => parseInt(id))
         : [];
 
-        if (!categoryIds.length) {
-        return res.status(400).json({ error: 'Categories parameter is required' });
-        }
+        if (!categoryIds.length) {}
 
         const { sort, limit, offset } = options;

[NoCoverage] ObjectLiteral
services/productService.js:76:30
 
         const { sort, limit, offset } = options;
         
-        const queryOptions = {
-            where: {
-                categoryId: {
-                    [Op.in]: Array.isArray(categoryIds) ? categoryIds : [categoryIds]
-                }
-            },
-            include: Category,
-        };
+        const queryOptions = {};
 
         // Add sorting if specified

[NoCoverage] ObjectLiteral
services/productService.js:77:20
         const { sort, limit, offset } = options;
         
         const queryOptions = {
-            where: {
-                categoryId: {
-                    [Op.in]: Array.isArray(categoryIds) ? categoryIds : [categoryIds]
-                }
-            },
+            where: {},
             include: Category,
         };

[NoCoverage] ObjectLiteral
services/productService.js:78:29
         
         const queryOptions = {
             where: {
-                categoryId: {
-                    [Op.in]: Array.isArray(categoryIds) ? categoryIds : [categoryIds]
-                }
+                categoryId: {}
             },
             include: Category,

[NoCoverage] ArrayDeclaration
services/productService.js:79:73
         const queryOptions = {
             where: {
                 categoryId: {
-                    [Op.in]: Array.isArray(categoryIds) ? categoryIds : [categoryIds]
+                    [Op.in]: Array.isArray(categoryIds) ? categoryIds : []
                 }
             },

[NoCoverage] BlockStatement
services/productService.js:86:19
         };
 
         // Add sorting if specified
-        if (sort) {
-            queryOptions.order = [sort.split(',')];
-        }
+        if (sort) {}
 
         // Add pagination if specified

[NoCoverage] StringLiteral
services/productService.js:87:46
 
         // Add sorting if specified
         if (sort) {
-            queryOptions.order = [sort.split(',')];
+            queryOptions.order = [sort.split("")];
         }
 

[NoCoverage] ConditionalExpression
services/productService.js:91:13
         }
 
         // Add pagination if specified
-        if (limit) {
+        if (false) {
             queryOptions.limit = parseInt(limit);
         }

[NoCoverage] ConditionalExpression
services/productService.js:94:13
         if (limit) {
             queryOptions.limit = parseInt(limit);
         }
-        if (offset) {
+        if (true) {
             queryOptions.offset = parseInt(offset);
         }
