[Survived] ObjectLiteral
models/cartItem.js:6:47
 const Cart = require('./cart');
 const Product = require('./product');
 
-const CartItem = sequelize.define('CartItem', {
-  quantity: {
-    type: DataTypes.INTEGER,
-    allowNull: false,
-    defaultValue: 1,
-  },
-});
+const CartItem = sequelize.define('CartItem', {});
 
 CartItem.belongsTo(Cart, { foreignKey: 'cartId' });

[Survived] BooleanLiteral
models/cartItem.js:9:16
 const CartItem = sequelize.define('CartItem', {
   quantity: {
     type: DataTypes.INTEGER,
-    allowNull: false,
+    allowNull: true,
     defaultValue: 1,
   },

[Survived] ObjectLiteral
models/cartItem.js:14:26
   },
 });
 
-CartItem.belongsTo(Cart, { foreignKey: 'cartId' });
+CartItem.belongsTo(Cart, {});
 CartItem.belongsTo(Product, { foreignKey: 'productId' });
 

[Survived] StringLiteral
models/cartItem.js:15:43
 });
 
 CartItem.belongsTo(Cart, { foreignKey: 'cartId' });
-CartItem.belongsTo(Product, { foreignKey: 'productId' });
+CartItem.belongsTo(Product, { foreignKey: "" });
 
 module.exports = CartItem;
