[Survived] StringLiteral
models/category.js:4:35
 const { DataTypes } = require('sequelize');
 const { sequelize } = require('./index');
 
-const Category = sequelize.define('Category', {
+const Category = sequelize.define("", {
   name: {
     type: DataTypes.STRING,

[Survived] BooleanLiteral
models/category.js:7:16
 const Category = sequelize.define('Category', {
   name: {
     type: DataTypes.STRING,
-    allowNull: false,
+    allowNull: true,
     unique: true,
   },

[Survived] BooleanLiteral
models/category.js:8:13
   name: {
     type: DataTypes.STRING,
     allowNull: false,
-    unique: true,
+    unique: false,
   },
 });
